examples/render_all_grammars/pu/tests_functional_test_import_relativeimport_firs.pu
@startuml
            set namespaceSeparator .
        first.First *-- "1..*" second.Second
first.First *-- "1..*" relative.third.Third
class first.First  {
}


class ID <<match>> {
}


class STRING <<match>> {
}


class BOOL <<match>> {
}


class INT <<match>> {
}


class FLOAT <<match>> {
}


class STRICTFLOAT <<match>> {
}


class NUMBER <<match>> {
}

NUMBER <|-- STRICTFLOAT
NUMBER <|-- INT

class BASETYPE <<match>> {
}

BASETYPE <|-- NUMBER
BASETYPE <|-- FLOAT
BASETYPE <|-- BOOL
BASETYPE <|-- ID
BASETYPE <|-- STRING

class OBJECT <<abstract>> {
}

OBJECT <|-- BASETYPE

class second.Second  {
list[STRING] second
}


class relative.third.Third  {
list[Second] third
}


@enduml
